var datas = [
    {
        "cId": 2,
        "cName": "上海",
        "Dealers": [
                    {
                        "dId":"283221",
                        "dName": "上海美罗城店"
                    },
                    {
                        "dId":"283216",
                        "dName": "上海徐家汇店"
                    },
                    {
                        "dId":"283217",
                        "dName": "上海淮海路店"
                    },
                    {
                        "dId":"283218",
                        "dName": "上海联洋广场店"
                    },
                    {
                        "dId":"283219",
                        "dName": "上海国金中心店"
                    },
                    {
                        "dId":"283220",
                        "dName": "上海浦东嘉里中心店"
                    },
                    {
                        "dId":"283241",
                        "dName": "96广场店"
                    },
                    {
                        "dId":"283242",
                        "dName": "月星环球港店"
                    },
                    {
                        "dId":"283243",
                        "dName": "静安嘉里中心店"
                    },
                    {
                        "dId":"283244",
                        "dName": "中信泰富店"
                    },
                    {
                        "dId":"283245",
                        "dName": "IAPM 环贸广场店"
                    },
                    {
                        "dId":"283246",
                        "dName": "长宁路店"
                    }
            ]
    },
    {
        "cId": 9,
        "cName": "北京",
        "Dealers": [
                    {
                        "dId":"283227",
                        "dName": "北京金源燕莎店"
                    },
                    {
                        "dId":"283223",
                        "dName": "北京世贸天阶店"
                    },
                    {
                        "dId":"283224",
                        "dName": "北京望京嘉茂店"
                    },
                    {
                        "dId":"283225",
                        "dName": "北京东方广场店"
                    },
                    {
                        "dId":"283226",
                        "dName": "北京大屯店"
                    },
                    {
                        "dId":"283228",
                        "dName": "北京莱福士店"
                    },
                    {
                        "dId":"283233",
                        "dName": "嘉里中心店"
                    },
                    {
                        "dId":"283234",
                        "dName": "盈港店"
                    },
                    {
                        "dId":"283235",
                        "dName": "花园村店"
                    },
                    {
                        "dId":"283236",
                        "dName": "中关村店"
                    },
                    {
                        "dId":"283237",
                        "dName": "朝阳大悦城店"
                    },
                    {
                        "dId":"283238",
                        "dName": "西外店"
                    },
                    {
                        "dId":"283239",
                        "dName": "新东安商场"
                    },
                    {
                        "dId":"283240",
                        "dName": "颐堤港店"
                    },
                    {
                        "dId":"283222",
                        "dName": "北京新三里屯店"
                    }
            ]
    },
    {
        "cId": 293,
        "cName": "广州",
        "Dealers": [
                    {
                        "dId":"283229",
                        "dName": "广州天河城三店"
                    },
                    {
                        "dId":"283230",
                        "dName": "广州中信店"
                    },
/*                    {
                        "dId":"283231",
                        "dName": "广州龙口西店"
                    },*/
                    {
                        "dId":"283232",
                        "dName": "广州太古汇店"
                    }
            ]
    }
 ]